; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v6)
             (pred_11 ?v1 ?v11)
             (pred_7 ?v9 ?v11)
             (pred_12 ?v7 ?v9 )
	     (pred_8 ?v9)
             (pred_2 ?v13)
             (pred_1 ?v1)
             (pred_10 ?v11)
             (pred_4 ?v9)
             (pred_9 ?v1)
             (pred_3 ?v9)
             (pred_6 ))



(:action op_5
:parameters (?v12 ?v4 ?v2 ?v10)
:precondition (and (pred_2 ?v12) (pred_2 ?v4) (pred_1 ?v2) (pred_10 ?v10)
          (pred_5 ?v12 ?v4) (pred_11 ?v2 ?v10)
                   (pred_7 ?v4 ?v10) (pred_8 ?v12) 
                   (pred_4 ?v4) (pred_9 ?v2))
:effect (and  (pred_3 ?v4) (not (pred_4 ?v4))))


(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_2 ?v12) (pred_2 ?v5)
               (pred_8 ?v12) (pred_5 ?v12 ?v5) (pred_3 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v12))))

(:action op_3
:parameters (?v12 ?v2)
:precondition (and (pred_2 ?v12) (pred_1 ?v2) 
                  (pred_8 ?v12) (pred_12 ?v2 ?v12) (pred_6 ))
:effect (and (pred_9 ?v2)
   (not (pred_12 ?v2 ?v12)) (not (pred_6 ))))


(:action op_2
:parameters (?v12 ?v8 ?v3)
:precondition (and (pred_2 ?v12) (pred_1 ?v8) (pred_1 ?v3)
                  (pred_8 ?v12) (pred_9 ?v3) (pred_12 ?v8 ?v12))
:effect (and (pred_9 ?v8) (pred_12 ?v3 ?v12)
        (not (pred_9 ?v3)) (not (pred_12 ?v8 ?v12))))

(:action op_4
:parameters (?v12 ?v2)
:precondition (and (pred_2 ?v12) (pred_1 ?v2) 
                  (pred_8 ?v12) (pred_9 ?v2))
:effect (and (pred_6 ) (pred_12 ?v2 ?v12) (not (pred_9 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_06 obj_08 obj_12 obj_01 obj_19 obj_04 obj_17 obj_20 obj_02 obj_07 obj_21 obj_14 obj_18 obj_05 obj_15
    obj_11 obj_03
    obj_10 obj_09 obj_16
    )

    (:init
       (pred_6)

       (pred_2 obj_13)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_04)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_2 obj_21)
       (pred_2 obj_14)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_15)
       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_16)

       (pred_5 obj_13 obj_01)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_06 obj_19)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_12 obj_08)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_13)
       (pred_5 obj_19 obj_02)
       (pred_5 obj_19 obj_04)
       (pred_5 obj_19 obj_06)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_04 obj_07)
       (pred_5 obj_04 obj_17)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_04 obj_19)
       (pred_5 obj_17 obj_21)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_04)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_20 obj_02)
       (pred_5 obj_20 obj_01)
       (pred_5 obj_02 obj_18)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_02 obj_20)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_21)
       (pred_5 obj_07 obj_04)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_21 obj_17)
       (pred_5 obj_21 obj_07)
       (pred_5 obj_14 obj_18)
       (pred_5 obj_14 obj_20)
       (pred_5 obj_18 obj_05)
       (pred_5 obj_18 obj_02)
       (pred_5 obj_18 obj_14)
       (pred_5 obj_05 obj_15)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_18)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_15 obj_05)
       (pred_4 obj_12)
       (pred_4 obj_19)
       (pred_4 obj_08)
       (pred_7  obj_12 obj_11)
       (pred_7  obj_19 obj_03)
       (pred_7  obj_08 obj_11)
       (pred_3 obj_13)
       (pred_3 obj_06)
       (pred_3 obj_01)
       (pred_3 obj_04)
       (pred_3 obj_17)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_3 obj_07)
       (pred_3 obj_21)
       (pred_3 obj_14)
       (pred_3 obj_18)
       (pred_3 obj_05)
       (pred_3 obj_15)

       (pred_11  obj_10 obj_11)
       (pred_11  obj_09 obj_03)
       (pred_11  obj_16 obj_11)
       (pred_12 obj_10 obj_01)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_16 obj_14)
       (pred_8 obj_01)
    )

    (:goal (and
       (pred_12 obj_10 obj_20)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_16 obj_07)
    ))
(:constraints
  (always (not (pred_8 obj_02)))
)
)

; plan
1. (op_3 obj_01 obj_10)
   deleted: (pred_12 obj_10 obj_01) (pred_6)
   added: (pred_9 obj_10)
   goals met: 0 of 3
2. (op_1 obj_01 obj_20)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_20)
   goals met: 0 of 3
3. (op_4 obj_20 obj_10)
   deleted: (pred_9 obj_10)
   added: (pred_6) (pred_12 obj_10 obj_20)
   goals met: 1 of 3
4. (op_1 obj_20 obj_14)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_14)
   goals met: 1 of 3
5. (op_1 obj_14 obj_18)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_18)
   goals met: 1 of 3
6. (op_1 obj_18 obj_05)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_05)
   goals met: 1 of 3
7. (op_1 obj_05 obj_15)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_15)
   goals met: 1 of 3
8. (op_3 obj_15 obj_09)
   deleted: (pred_12 obj_09 obj_15) (pred_6)
   added: (pred_9 obj_09)
   goals met: 1 of 3
9. (op_1 obj_15 obj_05)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_05)
   goals met: 1 of 3
10. (op_1 obj_05 obj_07)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_07)
   goals met: 1 of 3
11. (op_4 obj_07 obj_09)
   deleted: (pred_9 obj_09)
   added: (pred_6) (pred_12 obj_09 obj_07)
   goals met: 2 of 3
12. (op_1 obj_07 obj_05)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_05)
   goals met: 2 of 3
13. (op_1 obj_05 obj_18)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_18)
   goals met: 2 of 3
14. (op_1 obj_18 obj_14)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_14)
   goals met: 2 of 3
15. (op_3 obj_14 obj_16)
   deleted: (pred_12 obj_16 obj_14) (pred_6)
   added: (pred_9 obj_16)
   goals met: 2 of 3
16. (op_1 obj_14 obj_18)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_18)
   goals met: 2 of 3
17. (op_1 obj_18 obj_05)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_05)
   goals met: 2 of 3
18. (op_1 obj_05 obj_07)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_07)
   goals met: 2 of 3
19. (op_4 obj_07 obj_16)
   deleted: (pred_9 obj_16)
   added: (pred_6) (pred_12 obj_16 obj_07)
   goals met: 3 of 3
